# How to create a list of alphabets without typing them :)

In [1]:
import sys
sys.version
sys.version_info

sys.version_info(major=3, minor=6, micro=3, releaselevel='final', serial=0)

In [2]:
### Using .append()
# First we need to figure out the ASCII code of the alphabet letters \
# using the ord() function. 
print(ord('a'))
print(ord('z'))
print(ord('A'))
print(ord('Z'))

alphabet_list = list()
for i in range(97, 123):
    alphabet_list.append(chr(i))
    
print(alphabet_list)

97
122
65
90
['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z']

In [3]:
### Without .append()

l1 = [None] * 27      # without .append....one has to fill the list with None or 0 etc. empty list will not work!!!
for i in range(27):
    l1[i] = i
    
print(l1)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26]

In [4]:
s1=[]
for i in range(10):
    s1.append(i)
    print(i)
    
print(s1)

0
1
2
3
4
5
6
7
8
9
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [5]:
import pandas as pd
import numpy as np
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                     'D' : np.array([3] * 4,dtype='int32'),
                     'E' : pd.Categorical(["test","train","test","train"]),
                     'F' : 'foo' })

In [6]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
d=3*[1,2,4]
p=[40]*8
print(p)
d

[40, 40, 40, 40, 40, 40, 40, 40]

[1, 2, 4, 1, 2, 4, 1, 2, 4]

In [8]:
type(d)

list

In [9]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [10]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [11]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [12]:
df2.values

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']], dtype=object)

In [13]:
df2.sort_index(axis=1, ascending=False)

     F      E  D    C          B    A
0  foo   test  3  1.0 2013-01-02  1.0
1  foo  train  3  1.0 2013-01-02  1.0
2  foo   test  3  1.0 2013-01-02  1.0
3  foo  train  3  1.0 2013-01-02  1.0

In [14]:
df2[::-1]

     A          B    C  D      E    F
3  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
0  1.0 2013-01-02  1.0  3   test  foo

In [15]:
df2.sort_values(by='B', )

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [16]:
list('ABCD')

['A', 'B', 'C', 'D']

In [17]:
print(range(10))
list(range(10))

range(0, 10)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [18]:
np.random.randn(6,4)

array([[ 0.44119411,  0.0727835 ,  1.44924434,  3.59099434],
       [ 0.58216996,  0.2873812 , -3.21762162, -0.67172632],
       [-2.10809585, -0.00561462, -0.77156103,  1.92498738],
       [ 0.74188274, -0.70976198, -0.33418593, -1.1491839 ],
       [ 0.28701989,  1.0878124 , -1.04571525,  0.71132787],
       [-0.77459912,  0.58696664, -0.2445764 ,  2.29366221]])

In [19]:
pd.Series([1,2,'A',True, np.nan]) ### Very imp to call [] inside method, [] allows indexing of elements !!!!

0       1
1       2
2       A
3    True
4     NaN
dtype: object

---

# DataFrame, Selection/Subsetting, Slicing:

In [20]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
#df

In [21]:
type(df.loc[dates[0]])   # can't give int/numeric indexers to .loc[] object....loc[] is like .at() LABEL BASED !!!

pandas.core.series.Series

In [22]:
df.loc[dates[0]]

A   -0.768775
B    0.684178
C   -0.663426
D   -1.079794
Name: 2013-01-01 00:00:00, dtype: float64

^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

In [23]:
df.loc[dates[0], 'A']

-0.76877504598979307

In [24]:
df.at[dates[0],'A']

-0.76877504598979307

vvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvv

In [25]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [26]:
df.loc[dates[2],['A','B']]

A    1.531231
B    0.814522
Name: 2013-01-03 00:00:00, dtype: float64

In [27]:
df.loc[dates[0:3],['A','C']]

                   A         C
2013-01-01 -0.768775 -0.663426
2013-01-02 -2.192512  0.495759
2013-01-03  1.531231  0.328248

In [28]:
df.loc['20130102',['A','B']] ### We are giving labels as indexers here ...

A   -2.192512
B   -1.582022
Name: 2013-01-02 00:00:00, dtype: float64

---

In [29]:
df.iloc[0:3,0:3]

                   A         B         C
2013-01-01 -0.768775  0.684178 -0.663426
2013-01-02 -2.192512 -1.582022  0.495759
2013-01-03  1.531231  0.814522  0.328248

In [30]:
df.iloc[3]  ### row(s) is the 1st order indexer

A    0.340939
B   -1.876963
C   -0.322174
D    0.726131
Name: 2013-01-04 00:00:00, dtype: float64

In [31]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -2.192512  0.495759
2013-01-03  1.531231  0.328248
2013-01-05  0.257668 -1.147175

In [32]:
df.iloc[1:3, :]    ### Slice specific rows "Entirely" .....

                   A         B         C         D
2013-01-02 -2.192512 -1.582022  0.495759 -0.181631
2013-01-03  1.531231  0.814522  0.328248 -0.702574

In [33]:
l1=[0,1,2,3]
df.iloc[:,l1]
df.iloc[:,0:2]
# df.iloc[:,[0,2:3]]   will error out

                   A         B
2013-01-01 -0.768775  0.684178
2013-01-02 -2.192512 -1.582022
2013-01-03  1.531231  0.814522
2013-01-04  0.340939 -1.876963
2013-01-05  0.257668  1.297345
2013-01-06 -0.675657  0.939865

In [34]:
df.iloc[1,1]

-1.5820219785381724

In [35]:
df.iat[1,1]

-1.5820219785381724

# Setting values by lable:

In [36]:
df.loc[dates[0], 'A'] = 0

In [37]:
df

                   A         B         C         D
2013-01-01  0.000000  0.684178 -0.663426 -1.079794
2013-01-02 -2.192512 -1.582022  0.495759 -0.181631
2013-01-03  1.531231  0.814522  0.328248 -0.702574
2013-01-04  0.340939 -1.876963 -0.322174  0.726131
2013-01-05  0.257668  1.297345 -1.147175  1.324536
2013-01-06 -0.675657  0.939865 -0.834996  1.789421

In [38]:
df.iloc[0,0] = 10

In [39]:
df

                    A         B         C         D
2013-01-01  10.000000  0.684178 -0.663426 -1.079794
2013-01-02  -2.192512 -1.582022  0.495759 -0.181631
2013-01-03   1.531231  0.814522  0.328248 -0.702574
2013-01-04   0.340939 -1.876963 -0.322174  0.726131
2013-01-05   0.257668  1.297345 -1.147175  1.324536
2013-01-06  -0.675657  0.939865 -0.834996  1.789421

In [40]:
df.loc[:, 'D'] = [5]*len(df)

In [41]:
df

                    A         B         C  D
2013-01-01  10.000000  0.684178 -0.663426  5
2013-01-02  -2.192512 -1.582022  0.495759  5
2013-01-03   1.531231  0.814522  0.328248  5
2013-01-04   0.340939 -1.876963 -0.322174  5
2013-01-05   0.257668  1.297345 -1.147175  5
2013-01-06  -0.675657  0.939865 -0.834996  5

# A *where* operator & setting:

In [42]:
df[df==5] = -df

In [43]:
df

                    A         B         C  D
2013-01-01  10.000000  0.684178 -0.663426 -5
2013-01-02  -2.192512 -1.582022  0.495759 -5
2013-01-03   1.531231  0.814522  0.328248 -5
2013-01-04   0.340939 -1.876963 -0.322174 -5
2013-01-05   0.257668  1.297345 -1.147175 -5
2013-01-06  -0.675657  0.939865 -0.834996 -5

In [44]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [45]:
df1

                    A         B         C  D   E
2013-01-01  10.000000  0.684178 -0.663426 -5 NaN
2013-01-02  -2.192512 -1.582022  0.495759 -5 NaN
2013-01-03   1.531231  0.814522  0.328248 -5 NaN
2013-01-04   0.340939 -1.876963 -0.322174 -5 NaN

In [46]:
df1.loc[dates[0]:dates[1], 'E'] = 9

In [47]:
df1.dropna(how='any')

                    A         B         C  D    E
2013-01-01  10.000000  0.684178 -0.663426 -5  9.0
2013-01-02  -2.192512 -1.582022  0.495759 -5  9.0

In [48]:
df1.fillna(5)

                    A         B         C  D    E
2013-01-01  10.000000  0.684178 -0.663426 -5  9.0
2013-01-02  -2.192512 -1.582022  0.495759 -5  9.0
2013-01-03   1.531231  0.814522  0.328248 -5  5.0
2013-01-04   0.340939 -1.876963 -0.322174 -5  5.0

In [49]:
df.mean()

A    1.543612
B    0.046154
C   -0.357294
D   -5.000000
dtype: float64

In [50]:
np.mean(df['A'])

1.5436116102169952

In [51]:
np.mean(df.loc[dates[0],:])

1.2551878926121924

In [52]:
#data frame mean : on the other axis:
df.mean(1)

2013-01-01    1.255188
2013-01-02   -2.069694
2013-01-03   -0.581500
2013-01-04   -1.714549
2013-01-05   -1.148041
2013-01-06   -1.392697
Freq: D, dtype: float64

---

In [53]:
x=df['D'].shift(3)
x

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    NaN
2013-01-04   -5.0
2013-01-05   -5.0
2013-01-06   -5.0
Freq: D, Name: D, dtype: float64

---

In [54]:
df.sub(x, axis='index')

                   A         B         C    D
2013-01-01       NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN
2013-01-03       NaN       NaN       NaN  NaN
2013-01-04  5.340939  3.123037  4.677826  0.0
2013-01-05  5.257668  6.297345  3.852825  0.0
2013-01-06  4.324343  5.939865  4.165004  0.0

---

In [55]:
## Out = random int N such that start <= N <= stop

print(np.random.randint(1, 5))

## randn doesn't need an argument. can pass n or m x n in argument

print(np.random.randn(2,2))

2
[[-0.35995785  0.27063973]
 [-0.65329363  1.0604495 ]]

---

In [56]:
s = pd.Series(np.random.randint(0,7, size=10))
s.value_counts()

3    4
5    2
0    2
4    1
2    1
dtype: int64

---

In [57]:
#Upper to Lower case using ******  list comprehensions ***** :
s = ['A','B','C','D','ADA', 'Baba', 'Cabo']

[item.lower() for item in s]

['a', 'b', 'c', 'd', 'ada', 'baba', 'cabo']

In [58]:
#Upper to Lower case using ******** map and lambda function ********* :

###   map(lambda x: x.lower(), s) ..... will create map'ed object in memory location [py 3 feature]

list(map(lambda x: x.lower(), s))

['a', 'b', 'c', 'd', 'ada', 'baba', 'cabo']

---

# Join/Merge/Concat

## Concat *It's about rows*:

In [59]:
df = pd.DataFrame(np.random.randn(10,4))
pieces = [df[:3], df[3:7], df[7:]]
pd.concat(pieces)
pieces

[          0         1         2         3
 0  1.254587 -0.960772  0.441479 -0.021004
 1  1.297783 -0.260212 -1.673201  0.098077
 2  1.408193  1.827589  1.551881  0.261662,
           0         1         2         3
 3 -0.269578  0.449497 -0.847127  0.361895
 4 -0.706214 -0.288175 -0.585302 -2.076106
 5  0.652557 -0.334671  0.726920  0.833767
 6 -0.128302  1.851752 -0.971888  1.662051,
           0         1         2         3
 7  0.582996 -0.116360 -0.456264 -0.705891
 8 -1.301825  0.487505  2.942228 -0.614635
 9  0.244511 -0.098838 -0.575745  0.110388]

## Merge

In [60]:
left = pd.DataFrame({'key' : ['foo','foo'], 'lval':[1,2]})
right = pd.DataFrame({'key' : ['foo', 'foo'], 'rval':[4,6]})
print(left)
print(right)
pd.merge(left, right, on = "key")

   key  lval
0  foo     1
1  foo     2
   key  rval
0  foo     4
1  foo     6

   key  lval  rval
0  foo     1     4
1  foo     1     6
2  foo     2     4
3  foo     2     6

In [61]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [62]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
s = df.iloc[3]
df.append(s, ignore_index=True)

          A         B         C         D
0  1.299218  0.306955  1.833047  0.585767
1 -0.127258 -0.398261  0.442052 -0.219084
2 -0.146177 -1.291458  1.785845 -0.680465
3 -0.147941  1.694940 -0.446083 -1.419323
4 -0.229654  1.293791 -0.650592  1.611549
5 -1.062988 -0.758743 -0.780183 -0.640543
6  0.476454  0.035873  0.372533  1.937226
7  0.649644  0.229418  0.791713  1.346235
8 -0.147941  1.694940 -0.446083 -1.419323

# Grouping

In [63]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})

In [64]:
df.groupby('A').sum()

            C         D
A
bar  1.767210 -2.283193
foo -5.317839 -3.040945

In [65]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -1.539621 -0.241744
    three  1.494875 -0.712789
    two    1.811956 -1.328660
foo one   -2.863568 -0.171795
    three -0.172244 -1.167647
    two   -2.282028 -1.701504

---

# MultiIndex

In [66]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
                   ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]))
print(tuples)
print(type(tuples))
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

[('bar', 'one'), ('bar', 'two'), ('baz', 'one'), ('baz', 'two'), ('foo', 'one'), ('foo', 'two'), ('qux', 'one'), ('qux', 'two')]
<class 'list'>

                     A         B
first second
bar   one    -0.808915 -0.923963
      two     1.868961 -1.042639
baz   one    -0.038939 -1.214786
      two     0.075816  0.094670
foo   one    -0.370096 -1.955734
      two     0.380534  0.530116
qux   one    -0.184796 -1.848799
      two    -0.605370 -0.582776

In [67]:
l=[('A', 'a'),  ('A', 'b'), ('B','a'),  ('B','b')]   ##### list from tuples
df = pd.DataFrame(np.random.randn(5,4), index = list('ABCDE'), columns = l)
df

     (A, a)    (A, b)    (B, a)    (B, b)
A -0.479571  0.804535 -0.576398  0.066958
B  1.236154  0.735348  0.126806 -0.499268
C -0.995112 -0.467482 -0.879089 -1.195666
D -0.042648  0.379468 -0.535405 -0.105954
E  0.872266 -0.016048 -0.255329 -0.385154

In [68]:
df.columns = pd.MultiIndex.from_tuples(df.columns, names=['CAPS', 'lower'])
df

CAPS          A                   B
lower         a         b         a         b
A     -0.479571  0.804535 -0.576398  0.066958
B      1.236154  0.735348  0.126806 -0.499268
C     -0.995112 -0.467482 -0.879089 -1.195666
D     -0.042648  0.379468 -0.535405 -0.105954
E      0.872266 -0.016048 -0.255329 -0.385154

---

# stack() unstack()

In [69]:
df2=df[:4]

In [70]:
df2

CAPS          A                   B
lower         a         b         a         b
A     -0.479571  0.804535 -0.576398  0.066958
B      1.236154  0.735348  0.126806 -0.499268
C     -0.995112 -0.467482 -0.879089 -1.195666
D     -0.042648  0.379468 -0.535405 -0.105954

In [71]:
stacked = df2.stack()
stacked

CAPS            A         B
  lower
A a     -0.479571 -0.576398
  b      0.804535  0.066958
B a      1.236154  0.126806
  b      0.735348 -0.499268
C a     -0.995112 -0.879089
  b     -0.467482 -1.195666
D a     -0.042648 -0.535405
  b      0.379468 -0.105954

*With a “stacked” DataFrame or Series (having a MultiIndex as the index), the inverse operation of stack() is unstack(), which by default unstacks the last level:*

In [72]:
stacked.unstack()   ### creates a copy

CAPS          A                   B
lower         a         b         a         b
A     -0.479571  0.804535 -0.576398  0.066958
B      1.236154  0.735348  0.126806 -0.499268
C     -0.995112 -0.467482 -0.879089 -1.195666
D     -0.042648  0.379468 -0.535405 -0.105954

In [73]:
unstkd = stacked.unstack() 
unstkd

CAPS          A                   B
lower         a         b         a         b
A     -0.479571  0.804535 -0.576398  0.066958
B      1.236154  0.735348  0.126806 -0.499268
C     -0.995112 -0.467482 -0.879089 -1.195666
D     -0.042648  0.379468 -0.535405 -0.105954

In [74]:
unstkd.unstack()

CAPS  lower
A     a      A   -0.479571
             B    1.236154
             C   -0.995112
             D   -0.042648
      b      A    0.804535
             B    0.735348
             C   -0.467482
             D    0.379468
B     a      A   -0.576398
             B    0.126806
             C   -0.879089
             D   -0.535405
      b      A    0.066958
             B   -0.499268
             C   -1.195666
             D   -0.105954
dtype: float64

In [75]:
stacked.unstack(1)

CAPS          A                   B
lower         a         b         a         b
A     -0.479571  0.804535 -0.576398  0.066958
B      1.236154  0.735348  0.126806 -0.499268
C     -0.995112 -0.467482 -0.879089 -1.195666
D     -0.042648  0.379468 -0.535405 -0.105954

In [76]:
stacked.unstack(0)

CAPS          A                                       B                      \
              A         B         C         D         A         B         C
lower
a     -0.479571  1.236154 -0.995112 -0.042648 -0.576398  0.126806 -0.879089
b      0.804535  0.735348 -0.467482  0.379468  0.066958 -0.499268 -1.195666

CAPS
              D
lower
a     -0.535405
b     -0.105954

# Pivot Table:

It takes a number of arguments

data: A DataFrame object
*values*: values/column(s) to fill the pivot table by. a column or a list of columns to aggregate
*index*: Keys to group by on the pivot table index. a column, Grouper, array which has the same length as data, or list of them.  If an array is passed, it is being used as the same manner as column values.
*columns*: column(s) to pivot or melt by, Grouper, array which has the same length as data, or list of them. Keys to group by on the pivot table column. If an array is passed, it is being used as the same manner as column values.
*aggfunc*: you can place sum or mean of the values column(s) in the pivot cells. function to use for aggregation, defaulting to numpy.mean

In [77]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})
pd.pivot_table(df, index=['A','B'], values = ['D'], columns = 'C')

                D
C             bar       foo
A     B
one   A -0.210048 -0.582123
      B -0.943599  0.691616
      C -0.071142  1.155956
three A  0.536808       NaN
      B       NaN  1.176638
      C -0.628488       NaN
two   A       NaN  1.814646
      B  0.644525       NaN
      C       NaN -1.101929

In [78]:
pd.pivot_table(df, index=['A','B'], values = ['D','E'], columns = 'C')

                D                   E
C             bar       foo       bar       foo
A     B
one   A -0.210048 -0.582123 -0.168386 -0.109427
      B -0.943599  0.691616 -1.128318  2.124074
      C -0.071142  1.155956  0.948881  0.167797
three A  0.536808       NaN -2.090092       NaN
      B       NaN  1.176638       NaN -0.363828
      C -0.628488       NaN -1.912024       NaN
two   A       NaN  1.814646       NaN -1.169554
      B  0.644525       NaN  0.563973       NaN
      C       NaN -1.101929       NaN  1.079580

# Categoricals:

In [79]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

In [80]:
df['grade'] = df['raw_grade'].astype("category")
df['grade']

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [81]:
%%time
df["grade"].cat.categories

CPU times: user 143 µs, sys: 22 µs, total: 165 µs
Wall time: 604 µs

Index(['a', 'b', 'e'], dtype='object')

In [82]:
df.sort_values(by='grade')

   id raw_grade grade
0   1         a     a
3   4         a     a
4   5         a     a
1   2         b     b
2   3         b     b
5   6         e     e

In [83]:
if pd.Series([False, True, False]):
    print("I was true")
Traceback

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [ ]:
df.memory_usage()

In [ ]:
from fuzzywuzzy import fuzz
fuzz.ratio('this is a test', 'this is a test!')

In [ ]:
import sys
!conda install --yes --prefix {sys.prefix} fuzzywuzzy

# Missing Data:

In [85]:
df = pd.DataFrame(np.random.randn(5,3), index=['a', 'c', 'e', 'g', 'i'], columns=list('ABC'))

In [86]:
df=df.rename(columns={'A':"One", 'B':"Two", 'C':'Three'})

In [87]:
df

        One       Two     Three
a  0.467855 -1.431111 -2.104531
c  0.312336  0.765778  1.326198
e  1.298424  0.312119  1.251278
g  0.566426 -0.959976 -0.222132
i  1.683574 -0.893217 -0.315863

In [88]:
df['Four'] = 'bar'

In [89]:
df['Five'] = df['One'] < 0

In [90]:
df

        One       Two     Three Four   Five
a  0.467855 -1.431111 -2.104531  bar  False
c  0.312336  0.765778  1.326198  bar  False
e  1.298424  0.312119  1.251278  bar  False
g  0.566426 -0.959976 -0.222132  bar  False
i  1.683574 -0.893217 -0.315863  bar  False

In [91]:
# df2 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i'])

#### or #######

df2 = df.reindex(list('abcdefghi'))

In [92]:
df2

        One       Two     Three Four   Five
a  0.467855 -1.431111 -2.104531  bar  False
b       NaN       NaN       NaN  NaN    NaN
c  0.312336  0.765778  1.326198  bar  False
d       NaN       NaN       NaN  NaN    NaN
e  1.298424  0.312119  1.251278  bar  False
f       NaN       NaN       NaN  NaN    NaN
g  0.566426 -0.959976 -0.222132  bar  False
h       NaN       NaN       NaN  NaN    NaN
i  1.683574 -0.893217 -0.315863  bar  False

In [93]:
import pandas as pd

In [94]:
df2.isnull()

     One    Two  Three   Four   Five
a  False  False  False  False  False
b   True   True   True   True   True
c  False  False  False  False  False
d   True   True   True   True   True
e  False  False  False  False  False
f   True   True   True   True   True
g  False  False  False  False  False
h   True   True   True   True   True
i  False  False  False  False  False

In [95]:
s=pd.Series([1, 2])

In [96]:
s.index

RangeIndex(start=0, stop=2, step=1)

In [97]:
df2['One'] == np.nan

a    False
b    False
c    False
d    False
e    False
f    False
g    False
h    False
i    False
Name: One, dtype: bool

# *Time Stamp*

In [98]:
df2['timestamp'] = pd.Timestamp('20180101')

In [99]:
df2

        One       Two     Three Four   Five  timestamp
a  0.467855 -1.431111 -2.104531  bar  False 2018-01-01
b       NaN       NaN       NaN  NaN    NaN 2018-01-01
c  0.312336  0.765778  1.326198  bar  False 2018-01-01
d       NaN       NaN       NaN  NaN    NaN 2018-01-01
e  1.298424  0.312119  1.251278  bar  False 2018-01-01
f       NaN       NaN       NaN  NaN    NaN 2018-01-01
g  0.566426 -0.959976 -0.222132  bar  False 2018-01-01
h       NaN       NaN       NaN  NaN    NaN 2018-01-01
i  1.683574 -0.893217 -0.315863  bar  False 2018-01-01

In [100]:
df2.get_dtype_counts()

datetime64[ns]    1
float64           3
object            2
dtype: int64

In [101]:
# insert NaN's

###### df2.loc[['a','c','g'],['One','timestamp']] = None

###   or   ####

df2.loc[['a','c','g'],['One','timestamp']] = np.nan

In [102]:
df2

        One       Two     Three Four   Five  timestamp
a       NaN -1.431111 -2.104531  bar  False        NaT
b       NaN       NaN       NaN  NaN    NaN 2018-01-01
c       NaN  0.765778  1.326198  bar  False        NaT
d       NaN       NaN       NaN  NaN    NaN 2018-01-01
e  1.298424  0.312119  1.251278  bar  False 2018-01-01
f       NaN       NaN       NaN  NaN    NaN 2018-01-01
g       NaN -0.959976 -0.222132  bar  False        NaT
h       NaN       NaN       NaN  NaN    NaN 2018-01-01
i  1.683574 -0.893217 -0.315863  bar  False 2018-01-01

In [103]:
df3=df2[['One','Two','Three']]
df3.cumsum()

        One       Two     Three
a       NaN -1.431111 -2.104531
b       NaN       NaN       NaN
c       NaN -0.665333 -0.778332
d       NaN       NaN       NaN
e  1.298424 -0.353213  0.472945
f       NaN       NaN       NaN
g       NaN -1.313190  0.250814
h       NaN       NaN       NaN
i  2.981999 -2.206407 -0.065049

In [104]:
df3

        One       Two     Three
a       NaN -1.431111 -2.104531
b       NaN       NaN       NaN
c       NaN  0.765778  1.326198
d       NaN       NaN       NaN
e  1.298424  0.312119  1.251278
f       NaN       NaN       NaN
g       NaN -0.959976 -0.222132
h       NaN       NaN       NaN
i  1.683574 -0.893217 -0.315863

In [105]:
df2.mean(1)     #### mean row-wise

a   -1.767821
b         NaN
c    1.045988
d         NaN
e    0.953940
f         NaN
g   -0.591054
h         NaN
i    0.158165
dtype: float64

In [106]:
df2.mean(0)      #### mean col-wise

One      1.490999
Two     -0.441281
Three   -0.013010
Five     0.000000
dtype: float64

In [107]:
df2.fillna('Foo')

       One       Two     Three Four   Five            timestamp
a      Foo  -1.43111  -2.10453  bar  False                  Foo
b      Foo       Foo       Foo  Foo    Foo  2018-01-01 00:00:00
c      Foo  0.765778    1.3262  bar  False                  Foo
d      Foo       Foo       Foo  Foo    Foo  2018-01-01 00:00:00
e  1.29842  0.312119   1.25128  bar  False  2018-01-01 00:00:00
f      Foo       Foo       Foo  Foo    Foo  2018-01-01 00:00:00
g      Foo -0.959976 -0.222132  bar  False                  Foo
h      Foo       Foo       Foo  Foo    Foo  2018-01-01 00:00:00
i  1.68357 -0.893217 -0.315863  bar  False  2018-01-01 00:00:00

In [108]:
df2.fillna(method='pad')

        One       Two     Three Four   Five  timestamp
a       NaN -1.431111 -2.104531  bar  False        NaT
b       NaN -1.431111 -2.104531  bar  False 2018-01-01
c       NaN  0.765778  1.326198  bar  False 2018-01-01
d       NaN  0.765778  1.326198  bar  False 2018-01-01
e  1.298424  0.312119  1.251278  bar  False 2018-01-01
f  1.298424  0.312119  1.251278  bar  False 2018-01-01
g  1.298424 -0.959976 -0.222132  bar  False 2018-01-01
h  1.298424 -0.959976 -0.222132  bar  False 2018-01-01
i  1.683574 -0.893217 -0.315863  bar  False 2018-01-01

Method	Action
pad / ffill	Fill values forward
bfill / backfill	Fill values backward

The ffill() function is equivalent to fillna(method='ffill') and bfill() is equivalent to fillna(method='bfill')

In [109]:
df2.fillna(method='pad', limit = 1)

        One       Two     Three Four   Five  timestamp
a       NaN -1.431111 -2.104531  bar  False        NaT
b       NaN -1.431111 -2.104531  bar  False 2018-01-01
c       NaN  0.765778  1.326198  bar  False 2018-01-01
d       NaN  0.765778  1.326198  bar  False 2018-01-01
e  1.298424  0.312119  1.251278  bar  False 2018-01-01
f  1.298424  0.312119  1.251278  bar  False 2018-01-01
g       NaN -0.959976 -0.222132  bar  False 2018-01-01
h       NaN -0.959976 -0.222132  bar  False 2018-01-01
i  1.683574 -0.893217 -0.315863  bar  False 2018-01-01

In [111]:
dff = pd.DataFrame(np.random.randn(10,3), columns=list('ABC'))
dff

          A         B         C
0 -0.114239  1.317163 -0.552787
1 -0.733394  1.160704  1.897888
2  0.196858  0.482762 -0.943380
3  1.280229  0.932236  0.901458
4 -1.952087  1.656808 -0.563130
5  1.631795  1.264379  2.339405
6 -1.102445 -0.601515 -0.623765
7 -0.416743 -1.108262 -0.635925
8  0.316156  0.947608  0.710738
9 -0.880474  0.386961  1.041310

In [114]:
dff.iloc[5:8,2] = np.nan
dff.iloc[3:5,0] = np.nan
dff.iloc[4:6,1] = np.nan

dff

          A         B         C
0 -0.114239  1.317163 -0.552787
1 -0.733394  1.160704  1.897888
2  0.196858  0.482762 -0.943380
3       NaN  0.932236  0.901458
4       NaN       NaN -0.563130
5  1.631795       NaN       NaN
6 -1.102445 -0.601515       NaN
7 -0.416743 -1.108262       NaN
8  0.316156  0.947608  0.710738
9 -0.880474  0.386961  1.041310

In [115]:
dff.fillna(dff.mean()['B':'C'])

          A         B         C
0 -0.114239  1.317163 -0.552787
1 -0.733394  1.160704  1.897888
2  0.196858  0.482762 -0.943380
3       NaN  0.932236  0.901458
4       NaN  0.439707 -0.563130
5  1.631795  0.439707  0.356014
6 -1.102445 -0.601515  0.356014
7 -0.416743 -1.108262  0.356014
8  0.316156  0.947608  0.710738
9 -0.880474  0.386961  1.041310

In [133]:
X=dff.where(pd.notnull(dff), other=dff.mean(), axis='columns')
X

          A         B         C
0 -0.114239  1.317163 -0.552787
1 -0.733394  1.160704  1.897888
2  0.196858  0.482762 -0.943380
3 -0.137811  0.932236  0.901458
4 -0.137811  0.439707 -0.563130
5  1.631795  0.439707  0.356014
6 -1.102445 -0.601515  0.356014
7 -0.416743 -1.108262  0.356014
8  0.316156  0.947608  0.710738
9 -0.880474  0.386961  1.041310

cond : boolean NDFrame, array-like, or callable

    Where cond is True, keep the original value. Where False, replace with corresponding value from other. If cond is callable, it is computed on the NDFrame and should return boolean NDFrame or array. The callable must not change input NDFrame (though pandas doesn’t check it).

    New in version 0.18.1: A callable can be used as cond.

other : scalar, NDFrame, or callable

    Entries where cond is False are replaced with corresponding value from other. If other is callable, it is computed on the NDFrame and should return scalar or NDFrame. The callable must not change input NDFrame (though pandas doesn’t check it).

In [126]:

dff.A.mean()

-0.13781064951474004

In [127]:
dff.notnull()

       A      B      C
0   True   True   True
1   True   True   True
2   True   True   True
3  False   True   True
4  False  False   True
5   True  False  False
6   True   True  False
7   True   True  False
8   True   True   True
9   True   True   True

In [131]:
0>0

False

# Dropping axis labels with missing data: dropna

In [134]:
dff.A=np.nan

In [136]:
dff

    A         B         C
0 NaN  1.317163 -0.552787
1 NaN  1.160704  1.897888
2 NaN  0.482762 -0.943380
3 NaN  0.932236  0.901458
4 NaN       NaN -0.563130
5 NaN       NaN       NaN
6 NaN -0.601515       NaN
7 NaN -1.108262       NaN
8 NaN  0.947608  0.710738
9 NaN  0.386961  1.041310

In [ ]:
dff.dropna(axis=0)

axis : {0 or ‘index’, 1 or ‘columns’}, or tuple/list thereof

    Pass tuple or list to drop on multiple axes

how : {‘any’, ‘all’}

        any : if any NA values are present, drop that label
        all : if all values are NA, drop that label

In [138]:
dff

    A         B         C
0 NaN  1.317163 -0.552787
1 NaN  1.160704  1.897888
2 NaN  0.482762 -0.943380
3 NaN  0.932236  0.901458
4 NaN       NaN -0.563130
5 NaN       NaN       NaN
6 NaN -0.601515       NaN
7 NaN -1.108262       NaN
8 NaN  0.947608  0.710738
9 NaN  0.386961  1.041310

In [192]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta

dt = pd.date_range(start='20180101', periods=7, freq='D')

In [197]:
ts = pd.DataFrame([0.469112, np.nan, -5.689738, np.nan, -8.916232, np.nan, -12.0456])

In [200]:
ts = ts.set_index(dt)
ts

                    0
2018-01-01   0.469112
2018-01-02        NaN
2018-01-03  -5.689738
2018-01-04        NaN
2018-01-05  -8.916232
2018-01-06        NaN
2018-01-07 -12.045600

In [201]:
ts2 = ts.interpolate(method='time')
ts2

                    0
2018-01-01   0.469112
2018-01-02  -2.610313
2018-01-03  -5.689738
2018-01-04  -7.302985
2018-01-05  -8.916232
2018-01-06 -10.480916
2018-01-07 -12.045600

The method argument gives access to fancier interpolation methods. If you have scipy installed, you can set pass the name of a 1-d interpolation routine to method. You’ll want to consult the full scipy interpolation documentation and reference guide for details. The appropriate interpolation method will depend on the type of data you are working with.

If you are dealing with a time series that is growing at an increasing rate, method='quadratic' may be appropriate.
If you have values approximating a cumulative distribution function, then method='pchip' should work well.
To fill missing values with goal of smooth plotting, use method='akima'.
For a floating-point index, use method='values': DF or series...

df.interpolate(method='barycentric')
df.interpolate(method='pchip')
df.interpolate(method='akima')


When interpolating via a polynomial or spline approximation, you must also specify the degree or order of the approximation:

df.interpolate(method='spline', order=2)
df.interpolate(method='polynomial', order=2)

In [204]:
ser = pd.Series(np.sort(np.random.uniform(size=100)))

# interpolate at new_index
new_index = ser.index | pd.Index([49.25, 49.5, 49.75, 50.25, 50.5, 50.75])
new_index

Float64Index([ 0.0,  1.0,  2.0,  3.0,  4.0,  5.0,  6.0,  7.0,  8.0,  9.0,
              ...
              90.0, 91.0, 92.0, 93.0, 94.0, 95.0, 96.0, 97.0, 98.0, 99.0],
             dtype='float64', length=106)

# Replavce values:

In [205]:
ser = pd.Series([0., 1., 2., 3., 4.])

ser.replace(0, 5)

0    5.0
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

In [206]:
ser.replace([0, 1, 2, 3, 4], [4, 3, 2, 1, 0])

0    4.0
1    3.0
2    2.0
3    1.0
4    0.0
dtype: float64

In [207]:
ser.replace({0: 10, 1: 100})

0     10.0
1    100.0
2      2.0
3      3.0
4      4.0
dtype: float64

In [227]:
df = pd.DataFrame(np.random.randn(10, 2))

In [228]:
df

          0         1
0  1.261845 -2.349414
1  0.489666 -0.011859
2 -1.989584 -0.427048
3 -0.223046 -0.267991
4 -0.661280  0.900199
5 -0.644205 -0.585126
6 -0.222805 -2.389319
7  0.729566  1.020647
8 -1.036583 -1.032888
9 -0.387967 -1.041545

In [233]:
pos = np.random.rand(df.shape[0]) > 0.9
pos
df[pos] = 11
df

           0          1
0  11.000000  11.000000
1   0.489666  -0.011859
2  11.000000  11.000000
3  -0.223046  -0.267991
4  -0.661280   0.900199
5  -0.644205  -0.585126
6  -0.222805  -2.389319
7   0.729566   1.020647
8  11.000000  11.000000
9  -0.387967  -1.041545

In [234]:
df00 = df.values[0, 0]
df00

11.0

You can also operate on the DataFrame in place

In [120]: df.replace(1.5, np.nan, inplace=True)

In [243]:
ser = pd.Series(np.sort(np.random.uniform(size=100)))

# interpolate at new_index
new_index = ser.index | pd.Index([49.25, 49.5, 49.75, 50.25, 50.5, 50.75])

interp_s = ser.reindex(new_index).interpolate(method='pchip')
type(ser.index)
type(pd.Index([49.25, 49.5, 49.75, 50.25, 50.5, 50.75]))

pandas.core.indexes.numeric.Float64Index

In [240]:
interp_s

0.0     0.015942
1.0     0.019460
2.0     0.026131
3.0     0.028687
4.0     0.028700
5.0     0.039860
6.0     0.053045
7.0     0.058952
8.0     0.080991
9.0     0.088249
10.0    0.093505
11.0    0.126775
12.0    0.127399
13.0    0.145302
14.0    0.176184
15.0    0.180746
16.0    0.232437
17.0    0.233970
18.0    0.246866
19.0    0.251320
20.0    0.269452
21.0    0.282131
22.0    0.303557
23.0    0.307748
24.0    0.310252
25.0    0.352190
26.0    0.359583
27.0    0.368523
28.0    0.370384
29.0    0.375770
          ...
70.0    0.720741
71.0    0.721577
72.0    0.722900
73.0    0.725770
74.0    0.739582
75.0    0.741845
76.0    0.748230
77.0    0.768352
78.0    0.776320
79.0    0.780325
80.0    0.809700
81.0    0.820769
82.0    0.843713
83.0    0.845396
84.0    0.856820
85.0    0.878790
86.0    0.879419
87.0    0.900890
88.0    0.904071
89.0    0.904161
90.0    0.933196
91.0    0.934908
92.0    0.935011
93.0    0.935689
94.0    0.948296
95.0    0.949620
96.0    0.954161
97.0    0.956302
98.0    0.958901
99.0    0.992782
Length: 106, dtype: float64

# Note If you want to consider inf and -inf to be “NA” in computations, you can set pandas.options.mode.use_inf_as_na = True.

In [218]:
pd.options.mode.use_inf_as_na = True

OptionError: 'You can only set the value of existing options'

In [247]:
# Create a pd series:
import pandas as pd
people = pd.Series([3000000, 850000], index=['Albania','Andorra'], name='population')

In [248]:
people

Albania    3000000
Andorra     850000
Name: population, dtype: int64

## You can multiply 2 series or a df with a series and this happens index-wise!!!